// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным

int day_number = 5;
if (1 <= day_number && day_number <=5)
{
    Console.WriteLine("Weekdays");
}
if (6 <= day_number && day_number <=7)
{
    Console.WriteLine("Weekend!!!");
}
